{"sections":{"main":{"type":"page","settings":{}},"custom_content_rLMgxj":{"type":"custom-content","blocks":{"text_c8ypVp":{"type":"text","settings":{"title":"","subheading":"","text":"<p><strong>San Diego, CA (November 11, 2023)<\/strong> - FLX Bike, a leading name in the electric bicycle industry, is proud to announce a significant transformation. The company will now be known as Superhuman Bikes, marking a thrilling new chapter in the brand's journey to redefine electric mobility.  <\/p><p> <\/p><p><a href=\"https:\/\/superhumanbikes.com\/\" target=\"_blank\"><span style=\"text-decoration:underline\">Superhuman Bikes<\/span><\/a> is more than just a name change; it represents a bold vision and an unwavering commitment to pushing the boundaries of what electric bicycles can be. The transformation coincides with the company's expanded mission to empower riders to experience the world in extraordinary ways, offering products that are nothing short of superhuman in their capabilities. <\/p><p> <\/p><p>In recent years, FLX Bike has been at the forefront of innovation in the e-bike industry, known for its high-performance electric bicycles that offer a seamless blend of technology, style, and sustainability. With the evolution into Superhuman Bikes, the company is taking this commitment to the next level. The new name encapsulates the idea that riding a Superhuman Bike empowers riders to transcend their limitations, explore more, and make a positive impact on the environment. <\/p><p> <\/p><p>\"We've always believed in the transformational power of electric bikes. Now, with our rebrand as Superhuman Bikes, we're doubling down on that belief,\" said Rob Rast, the founder and president of Superhuman Bikes. \"Our mission is to provide riders with the means to become superhuman, to unlock new adventures, and to embrace sustainable transportation in a way that feels extraordinary.\" <\/p><p> <\/p><p>Superhuman Bikes will continue to offer a diverse range of electric bicycles, from powerful <a href=\"https:\/\/superhumanbikes.com\/collections\/mountain-electric-bikes\" target=\"_blank\"><span style=\"text-decoration:underline\">e-MTB’s<\/span><\/a> (electric mountain bikes) for off-road enthusiasts to stylish urban e-bikes for daily commuters. Every product is designed with cutting-edge technology, a commitment to quality, and an unwavering focus on sustainability. <\/p><p> <\/p><p>Customers and partners can expect the same exceptional service and dedication to innovation that they've come to know from the brand. Superhuman Bikes is confident that this rebranding will not only enhance the company's identity but also reflect its ongoing efforts to develop the most advanced and eco-friendly electric bicycles on the market. <\/p><p> <\/p><p>Superhuman Bikes invites everyone to join in celebrating this exciting transformation and looks forward to a future where electric mobility is truly superhuman. <\/p><p> <\/p><p> <\/p><p><strong>About Superhuman Bikes:<\/strong> <\/p><p> <\/p><p>Superhuman Bikes is a leading electric bicycle manufacturer in San Diego, California that is dedicated to delivering exceptional electric mobility solutions to riders worldwide. Formerly known as FLX Bike, the company's rebranding reflects its mission to empower riders to transcend their limits and redefine what's possible on two wheels. Visit <a href=\"http:\/\/www.superhumanbikes.com\/\" target=\"_blank\"><span style=\"text-decoration:underline\">www.superhumanbikes.com<\/span><\/a> to buy online or to schedule a test ride. <\/p>","width":"100%","alignment":"center","align_text":"left","text_size":"medium","text_color":"black","button_label":"","button_link":"","button_style":"sf__btn-primary","button_size":"","block_custom_class":""}}},"block_order":["text_c8ypVp"],"settings":{"heading":"","subheading":"","description":"","header_alignment":"center","container":"container-fluid","background_color":"","gap":30,"use_scroll_mobile":false,"gap_mobile":16,"padding_top":0,"padding_bottom":0,"custom_class":""}}},"order":["main","custom_content_rLMgxj"]}