{"sections":{"main":{"type":"page","settings":{}},"custom_content_Dmrjn3":{"type":"custom-content","blocks":{"text_X7eRUD":{"type":"text","settings":{"title":"","subheading":"","text":"<p>It was on a biking trip in China that Superhuman founder, Rob, found himself trying to outrun a typhoon on a bike that simply wasn't built to take him where he needed to go.<\/p><p>As an athlete and engineer, Rob knew he needed gear that could go faster and take him further than what was possible at the time.<\/p><p><strong>It was then that idea for the Roadster, our first ever e-bike was formed.<\/strong><\/p><p>It was going to be perfect. A mid-motor mounted, state of the art, performance ebike that crushed any landscape while looking cool as hell.<\/p><p><strong>The Indiegogo campaign for the Roadster raised almost 2 million dollars.<\/strong><\/p><p>Then came the Babymaker. An even sleeker and sexier urban street machine that went on to <strong>shatter crowdfunding records raising a whopping 13 Million Dollars and launching us into the spotlight.<\/strong><\/p><p>Since then, we've been designing, assembling, and creating best in class ebikes and skateboards that push the boundaries of what's possible. The Weapon, Gladiator, F5 Trail, Bandit II, and Miles Board skateboards - all sporting best in class tech and creating the best experience possible for our riders.<\/p><p>At Superhuman we believe that through creative thinking and technolog, more is always possible. We want to push the boundaries - go faster, farther, and with more power. Superhuman is more than a brand. It's a signal in the sky, calling those heroes who believe in the same thing.<\/p><p>We're ready to slap a battery on whatever clicks and give it a superpowered upgrade. If it can roll, shred, or move, we'll give it our mad scientist twist to see just how badass it can be.<\/p><p><strong>If you want more too, join our League of Superhumans and let's ride.<\/strong><\/p>","width":"100%","alignment":"center","align_text":"left","text_size":"medium","text_color":"black","button_label":"","button_link":"","button_style":"sf__btn-primary","button_size":"","block_custom_class":""}}},"block_order":["text_X7eRUD"],"settings":{"heading":"","subheading":"","description":"","header_alignment":"center","container":"container-fluid","background_color":"","gap":30,"use_scroll_mobile":false,"gap_mobile":16,"padding_top":0,"padding_bottom":0,"custom_class":""}}},"order":["main","custom_content_Dmrjn3"]}