{"sections":{"main":{"type":"page","settings":{}},"custom_content_i3ea8L":{"type":"custom-content","blocks":{"text_JFYpBp":{"type":"text","settings":{"title":"Superhuman Bikes Signs Shane Davis as part of Ongoing Name, Image and Likeness (NIL) Program","subheading":"","text":"<p><\/p><p><em>The multifaceted digital marketing program will feature the professional BMX rider’s escapades on their line of electric bikes.<\/em><\/p><p>San Diego, January 25, 2024 – Superhuman Bikes, an innovator in the electric bike industry, is announcing a dynamic new partnership in the realm of Name, Image, and Likeness (NIL). This strategic collaboration with professional BMX rider, Shane Davis, will include social and digital marketing campaigns throughout the year and will chronicle his electric bike adventures across Southern California.<\/p><p>This collaboration signifies one of Superhuman Bike's NIL sponsorships, contributing to their ongoing Name, Image, and Likeness program. The company invites athletes, artists, influencers, and anyone with a relevant audience to apply on the Superhuman Bikes website and showcase why they exemplify the essence of the brand.<\/p><p>\"We are thrilled to announce this groundbreaking partnership with Shane”, said Rob Rast, President at Superhuman Bikes. “We believe that Shane's influence and passion will play a pivotal role in shaping the future of our brand. Together we aim to inspire and uplift our community, encouraging them to embark on superhuman journeys of their own.\"<\/p><p>Superhuman Bikes will be incorporating Davis's unique insights and influence into the brand's marketing initiatives, fostering a deeper connection with the target audience. This partnership aligns with Superhuman Bikes' mission to inspire and empower individuals to embrace an active and adventurous lifestyle.<\/p><p>\"I’m stoked to team up with Superhuman Bikes!”, said Shane Davis, professional BMX rider. “Their vibe of pushing electric bike limits totally matches my energy. Pumped to share the thrill and a lot of great content!\" <\/p><p>The Collaboration will start with a campaign, featuring Shane Davis showcasing the capabilities of Superhuman Bikes. The campaign will be launched across various media channels, including social media, digital platforms, and traditional advertising.<\/p><p><strong>About Superhuman Bikes:<\/strong><\/p><p>Superhuman Bikes is a leading electric bicycle manufacturer in San Diego, California that is dedicated to delivering exceptional electric mobility solutions to riders worldwide. Formerly known as FLX Bike, the company's rebranding reflects its mission to empower riders to transcend their limits and redefine what's possible on two wheels. For more information about Superhuman Bikes, please visit www.superhumanbikes.com.<\/p><p><a href=\"https:\/\/www.superhumanbikes.com\/\"><span style=\"text-decoration:underline\">www.superhumanbikes.com<\/span><\/a><\/p><p><a href=\"https:\/\/www.instagram.com\/superhuman_bikes\"><span style=\"text-decoration:underline\">www.instagram.com\/superhuman_bikes<\/span><\/a><\/p><p><a href=\"https:\/\/www.twitter.com\/superhumanbikes\"><span style=\"text-decoration:underline\">www.twitter.com\/superhumanbikes<\/span><\/a><\/p><p><strong>About Shane Davis:<\/strong><\/p><p>Shane Davis, a professional BMX rider from Temecula, California, has built an impressive track record in the world of bmx. With his time at Nitro Circus, Shane gained recognition for his skilled execution, contributing significantly to the bmx scene. He is a recognized personality across multiple platforms, including his YouTube Channel and his Podcast. <\/p>","width":"100%","alignment":"center","align_text":"left","text_size":"medium","text_color":"black","button_label":"","button_link":"","button_style":"sf__btn-primary","button_size":"","block_custom_class":""}}},"block_order":["text_JFYpBp"],"settings":{"heading":"","subheading":"","description":"","header_alignment":"center","container":"container-fluid","background_color":"","gap":30,"use_scroll_mobile":false,"gap_mobile":16,"padding_top":0,"padding_bottom":0,"custom_class":""}}},"order":["main","custom_content_i3ea8L"]}