{"sections":{"main":{"type":"page","settings":{}},"custom_content_cnTT7Q":{"type":"custom-content","blocks":{"text_KeGUAd":{"type":"text","settings":{"title":"","subheading":"","text":"<p><strong>FOR IMMEDIATE RELEASE<\/strong><\/p><p><strong>Superhuman Bikes Unleashes Game-Changing Name, Image, and Likeness Campaign to Discover Influencers<\/strong><\/p><p>SAN DIEGO, November 20, 2023 – Superhuman Bikes, a trailblazer in the world of cutting-edge electric bicycle technology, is proud to unveil its latest venture – a dynamic Name, Image, and Likeness (NIL) campaign set to redefine the landscape of influencer partnerships.<\/p><p>In an era where individuality and authenticity reign supreme, Superhuman Bikes is on the hunt for extraordinary influencers to join forces and amplify the brand’s essence. As the electric bike industry undergoes a revolutionary transformation, Superhuman Bikes is leveraging the power of influencers to connect with audiences on a deeper level.<\/p><p>This campaign marks a strategic move by Superhuman Bikes to not only showcase its state-of-the-art products but also to celebrate the diverse stories and lifestyles of those who embody the spirit of the brand. By embracing influencers from various backgrounds and cycling disciplines, Superhuman Bikes aims to create a community that transcends traditional boundaries.<\/p><p>“We believe in the power of individuality, and our Name, Image, and Likeness campaign is designed to spotlight the unique voices that make up the fabric of Superhuman Bikes,” said Rob Rast, President at Superhuman Bikes. “We’re not just looking for influencers; we’re searching for passionate individuals who share our commitment to pushing boundaries and embracing the extraordinary.”<\/p><p>Superhuman Bikes invites all athletes, artists, influencers, and anyone with a relevant audience to apply and showcase why they exemplify the essence of the brand. The chosen influencers will receive exclusive access to Superhuman Bikes’ latest innovations, participate in thrilling campaigns, and become key players in the evolution of the cycling community.<\/p><p>To apply or learn more about the Superhuman Bikes NIL campaign, visit <a href=\"https:\/\/superhumanbikes.com\/nil\" title=\"https:\/\/superhumanbikes.com\/nil\">superhumanbikes.com\/nil<\/a>. <\/p><p><strong>About Superhuman Bikes:<\/strong><\/p><p>Superhuman Bikes is a leading electric bicycle manufacturer in San Diego, California that is dedicated to delivering exceptional electric mobility solutions to riders worldwide. Formerly known as FLX Bike, the company's rebranding reflects its mission to empower riders to transcend their limits and redefine what's possible on two wheels. For more information about Superhuman Bikes, please visit www.superhumanbikes.com.<\/p><p><a href=\"https:\/\/www.superhumanbikes.com\" title=\"https:\/\/www.superhumanbikes.com\">www.superhumanbikes.com<\/a><\/p><p><a href=\"https:\/\/www.instagram.com\/superhuman_bikes\" title=\"https:\/\/www.instagram.com\/superhuman_bikes\">www.instagram.com\/superhuman_bikes<\/a><\/p><p><a href=\"https:\/\/www.twitter.com\/superhumanbikes\" title=\"https:\/\/www.twitter.com\/superhumanbikes\">www.twitter.com\/superhumanbikes<\/a><\/p><p><\/p><p><\/p><p><\/p>","width":"100%","alignment":"center","align_text":"left","text_size":"medium","text_color":"black","button_label":"","button_link":"","button_style":"sf__btn-primary","button_size":"","block_custom_class":""}}},"block_order":["text_KeGUAd"],"settings":{"heading":"","subheading":"","description":"","header_alignment":"center","container":"container-fluid","background_color":"","gap":30,"use_scroll_mobile":false,"gap_mobile":16,"padding_top":0,"padding_bottom":0,"custom_class":""}}},"order":["main","custom_content_cnTT7Q"]}